{"posts":[{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/hello-world/"}],"tags":[{"name":"tag1","slug":"tag1","link":"/tags/tag1/"},{"name":"tag2","slug":"tag2","link":"/tags/tag2/"}],"categories":[{"name":"cat1","slug":"cat1","link":"/categories/cat1/"},{"name":"cat2","slug":"cat1/cat2","link":"/categories/cat1/cat2/"}],"pages":[{"title":"About","text":"I’m Xiaogang Shi, currently the head of the computing team at Kwaishou. Before that, I used to work as the head of the computing team at Tencent. I obtained PhD from Peking University 2016, advised by Prof. Bin Cui. I worked with Prof. Beng Chin OOI as a visiting scholar at NUS in 2013. I have served in the technical program committee of various international conferences, including KDD, SDM, DASFAA and BigData. I am also a committer of the Apache Flink project. Research InterestsDistributed and Parallel Computing, Databases, Query Optimization, Access Methods, Graph Processing, Stream Processing Publications Xiaogang Shi, Bin Cui, Gill Dobbie, Beng Chin Ooi. A unified ad-hoc data processing system. In ACM Transaction on Database Systems (TODS), vol. 42, issue 1, no. 6. Xiaogang Shi, Bin Cui, Yingxia Shao, Yunhai Tong. Tornado: A system for real-time iterative Analysis over evolving data. In Proceedings of the 2016 ACM SIGMOD International Conference on Management of Data (SIGMOD 2016), pp. 417-430. Xiaogang Shi, Bin Cui, Gill Dobbie, Beng Chin Ooi. Towards unified ad-hoc data processing. In Proceedings of the 2014 ACM SIGMOD International Conference on Management of Data (SIGMOD 2014), pp. 1263-1274. Xiaogang Shi, Yanfei Lv, Yingxia Shao, Bin Cui. bCATE: A balanced contention-aware transaction execution model for highly concurrent OLTP systems. In the 14th International Conference on Web-Age Information Management (WAIM 2013), pp. 769-780.","link":"/about/index.html"}]}